{
  "main": {
    "name": "Michał Popielarz",
    "occupation": "",
    "description": "Odwieczny gracz, z pasją do tworzenia gier",
    "image": "profilepic.jpg",
    "fileCV": "CV_Michał_Popielarz.docx",
    "bio": "Jestem osobą kreatywną, szukającą rozwiązań, bądź alternatywnego podejścia dla danego problemu, lubiącą angażować się w rozwój projektu, poprzez dostarczanie nowych pomysłów. Przygodę z programowaniem rozpocząłem w liceum, zaczynając od C++, w czasie studiów poznałem język C#, w którym obecnie programuję. Potrafię szybko się uczyć, lubię podejmować nowe wyzwania, znam dobrze język angielski - nie mam problemu w komunikacji w tym języku, posiadam First Cambridge Certificate. Ukończyłem studia inżynierskie na kierunku Informatyka Ogólna, obecnie posiadam absolutorium studiów magisterskich na kierunku Projektowanie Systemów Informatycznych i Sieci Komputerowych. Od zawsze pasjonowałem się grami, a moim marzeniem jest pracować w branży gier. Przygodę z tworzeniem gier zacząłem mając około 14 lat. Zacząłem od edytora świata gry Warcraft 3, w którym skrypty tworzone są w języku LUA, bądź za pomocą wbudowanego edytora. Używałem również programów Game Maker oraz RPG Maker. Pierwszy kontakt z silnikiem Unity miałem w czasie liceum, lecz pierwsze hobbistyczne projekty stworzyłem dopiero po zapoznaniu się z językiem C# w czasie studiów.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "michael010pl@gmail.com",
    "phone": "516-483-295",
    "address": {
      "street": "",
      "city": "",
      "state": "",
      "zip": ""
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "http://timbakerdev.com",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/people/Micha%C5%82-Popielarz/100005186677038/",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/micha%C5%82-popielarz-95b373207/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/michal010",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "Uniwersytet Warmińsko-Mazurski w Olsztynie",
        "degree": "Magister",
        "graduated": "02.2018 - Obecnie",
        "description": "Posiadam absolutorium na kierunku Projektowanie Systemów Informatycznych i Sieci Komputerowych. Planuję podejść do obrony w przyszłości."
      },
      {
        "school": "Uniwersytet Warmińsko-Mazurski w Olsztynie",
        "degree": "Inżynier",
        "graduated": "10.2014-02.2018",
        "description": "Ukończone studia na kierunku Informatyka Ogólna"
      }
    ],
    "work": [
      {
        "company": "Billennium",
        "title": "Unity Developer",
        "years": "12.2018 - 02.2020",
        "description": "Praca w firmie Billennium jako Unity Developer, podczas pracy nauczyłem się pracować w systemie Agile, ponadto poznałem wbudowany system kontrolii wersji Unity (Collab), nauczyłem się tworzyć zapytania do backendu, zapoznałem się ze stroną Trello, ułatwiającą pracę w grupie, zapoznałem się z frameworkami pozwalającymi na odczytywanie kodów QR bądź kodów kreskowych, pogłębiłem swoją wiedzę na temat frameworku Vuforia do tworzenia projektów AR/VR (miałem już styczność z tym frameworkiem podczas tworzenia pracy magisterskiej). Nauczyłem się kompilować projekty mobilne na system iOS (umiem również tworzyć projekty Unity na system Android). Pogłębiłem swoją wiedzę odnośnie możliwości WebGL'a. Nauczyłem się komunikacji między stroną a osadzoną na niej aplikacją Unity. Poznałem działanie narzędzia swagger, oraz zapoznałem się z notyfikacją JSON.   Poznałem podstawy programu Inkscape, oraz zgłębiłem swoją wiedzę odnośnie grafiki komputerowej."
      }
    ],
    "skills": [
      {
        "name": "Unity",
        "description": "Pierwszy kontakt z Unity miałem w 2012 roku, jednakże tajniki silnika zacząłem zgłębiać dopiero w czasie studiów, w trakcie nauki języka C#. Pierwszą, ukończoną grą było Rule The Furniture - mobilna, trójwymiarowa gra zręcznościowo-logicza, będąca częścią pracy inżynierskiej. Ponadto z Unity korzystałem będąc na 24 godzinnym maratonie programowania - Gamelake Jam odbywającym się w 'Centrum Nauki Kopernik', gdzie, wraz z ekipą, stworzyliśmy prototyp gry nawiązującej do tematyki 'Grawitacja nie istnieje'. Obecnie tworzę projekt komercyjnej gry mobilnej Cirpong, oraz część praktyczną pracy magisterskiej. Oprócz projektów hobbistycznych posiadam ponad rok doświadczenia zawodowego. Podczas wieloletniego korzystania z Unity miałem styczność z Scriptable Objectami, Asset Bundle, zapytaniami HTTP, serializacją oraz deserializacją JSON, frameworkiem Vuforia, frameworkami do obsługi kodów QR oraz kodów kreskowych, Unity Event, Unity Action, URP, HDRP, LWRP, Coroutine, VFX Graph, Shader Graph, UI (w tym tworzenie modularnych okien), Animation State Machine, Collab, komunikacją między stroną a osadzoną na niej aplikacji WebGL, tworzeniem projektów na Androida, iOS'a, WebGL'a oraz Windows."
      },
      {
        "name": "C#",
        "description": "Język ten znam na poziomie średnim/średnio-zaawansowanym. Potrafię korzystać z mocy obiektowości - polimorfizmu, interfejsów, struktur, delegatów, akcji, funkcji. W języku C# stworzyłem projekt odtwarzacza muzyki, automatycznego bota do discorda łączącego się z API w celu pomagania nowym graczom w grze MMO, program łączący się z API przetrzymującym dane kart do gry Hearthstone (nieukończony projekt) oraz program do czatu przez internet będącym dodatkowym projektem na studiach - korzystał z wielowątkowości oraz połączeń socketowych."
      },
      {
        "name": "C++",
        "description": "Z językiem C++ miałem styczność w liceum oraz na studiach, znam jego podstawy, umiem posługiwać się znacznikami, tworzyć klasy, stuktury oraz inne podstawowe elementy języka."
      },
      {
        "name": "Blender",
        "description": "Niestety, nie jestem jeszcze grafikiem komputerowym, jednakże chęć rozwoju dała mi możliwość poznania podstatowych elementów grafiki komputerowej - wiem, z czego składają się tekstury i czym składowe tekstur są (Ambient Occlusion map, Roughness map, Height map, Diffuse map, Metallic map itp.). Posiadam podstawową wiedzę jak działają animacje, wiem również do czego służy UV mapa, po co są 'normals' w face bądź vertexach, wiem również do czego służy weight painting. Oprócz wiedzy teoretycznej, osobiście potrafię stowrzyć prosty, oteksturowany model z bardzo prostą animacją."
      },
      {
        "name": "Inkscape",
        "description": "Jest to darmowy program do grafiki wektorowej (z możliwością eksportu w formie grafiki rastrowej). Potrzeba tworzenia własnych elementów graficznych do hobbistycznych projektów zainspirowały mnie do podjęcia nauki tego programu. Potrafię stworzyć proste elementy graficzne wykorzystywane głównie w UI w Unity."
      },
      {
        "name": "Materialize",
        "description": "Jest to darmowy program do tworzenia Height, Normal, Metallic, Smoothness, Edge oraz AO map. Wykorzystuję go do projektów hobbistycznych, warto dodać, że twórcy Uncharted wykorzystywali go do tworzenia elementów otoczenia w 1 oraz 2 odsłonie gry tej serii."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Cirpong",
        "shortDesc": "Komercyjna gra zręcznościowa na androida",
        "url": "",
        "description" : "Komercyjna, jednoosobowa, zręcznościowa gra mobilna (w produkcji) pisana na silniku Unity w języku C#. Jest to połączenie klasycznego pong-a z lekkim twistem - paletka porusza się po orbicie, a zamiast rywalizacji z innym graczem, gracz ma za zadanie zniszczyć wszystkie cegiełki widoczne na ekranie poprzez odbijanie od nich piłki. Styl graficzny gry, w dużej mierze opiera się na neonowym wyglądzie, uzyskanym za pomocą Post-Processingu. Wszystkie graficzne elemnty gry zostały wykonane za pomocą darmowego programu do grafiki wektorowej Inkscape. Gra posiada dwa tryby - Endless, w pełni działający, polegający na zdobyciu jak największej liczby punktów do momentu wypadnięcia piłki poza ekran (w przypadku zniszczenia wszystkich cegiełek zostaje wygenerowany nowy poziom), oraz Adventure pozwalający na przechodzenie poziomów progresywnie, z coraz to większym poziomem trudności, każde przejście poziomu jest oceniane systemem gwiazdek (od 0 do 3, wraz z połówkami), co widać na ekranie Level Selection, gwiazdki są przyznawane na podstawie zdobytych punktów na danym poziomie, a algorytm wyznacza ilość punktów potrzebnych na zdobycie połowy gwiazdki - dzięki czemu można zdeterminować wymaganą ilość punktów na uzyskanie maksymalnego wyniku. Tryb ten nie jest jeszcze w pełni sprawny, wymaga wprowadzenia paru poprawek. Dodatkowo gra została urozmaicona o możliwość odblokowania tzw. power-upów (ekran Upgrades Shop Menu), dzięki którym, podczas zbijania cegiełek jest szansa na pojawienie się ulepszenia (symbolizowane jasnoniebieską, transparetną sferą z ikoną w środku, odpowiadającą danemu power-upowi), które zostaje aktywowane w momencie przejścia piłki przez nie.",
        "images" : [ 
            {
                "original": "https://i.imgur.com/xSFfiED.png",
                "thumbnail": "https://i.imgur.com/xSFfiED.png",
                "description": "Main Menu (WIP)"
            },
            {
                "original" : "https://i.imgur.com/CB6iYM2.png",
                "thumbnail" : "https://i.imgur.com/CB6iYM2.png",
                "description": "Options Menu (WIP)"
            },
            {
                "original": "https://i.imgur.com/l799YqW.png",
                "thumbnail": "https://i.imgur.com/l799YqW.png",
                "description": "Upgrades Shop Menu (WIP)"
            },
            {
                "original": "https://i.imgur.com/nVdU699.png",
                "thumbnail": "https://i.imgur.com/nVdU699.png",
                "description": "Upgrades Shop Menu (WIP)"
            },
            {
                "original": "https://i.imgur.com/GmXkUus.png",
                "thumbnail": "https://i.imgur.com/GmXkUus.png",
                "description": "Game Mode Selection (WIP)"
            },
            {
                "original": "https://i.imgur.com/ejJKgac.png",
                "thumbnail": "https://i.imgur.com/ejJKgac.png",
                "description": "Level Selection (WIP)"
            },
            {
                "original": "https://i.imgur.com/CTatdul.png",
                "thumbnail": "https://i.imgur.com/CTatdul.png",
                "description": "Gameplay (WIP)"
            },
            {
                "original": "https://i.imgur.com/XWQgDtO.png",
                "thumbnail": "https://i.imgur.com/XWQgDtO.png",
                "description": "Gameplay (WIP)"
            },
            {
                "original": "https://i.imgur.com/vjG1fse.png",
                "thumbnail": "https://i.imgur.com/vjG1fse.png",
                "description": "Gameplay (WIP)"
            },
            {
                "original": "https://i.imgur.com/9gGombi.png",
                "thumbnail": "https://i.imgur.com/9gGombi.png",
                "description": "End Screen (WIP)"
            }
          ]
        },
        {
          "title": "Rule the Furniture",
          "shortDesc": "Projekt pracy inżynierskiej",
          "url": "",
          "description" : "Rule the furniture jest zręcznościową grą mobilną, napisaną na silniku Unity w języku C#. Jest to pierwszy, wykonany w całości projekt gry, będącej częścią praktyczną pracy inżynierskiej, większość assetów wykorzystanych w projekcie są assetami darmowymi, na licencji CC0, pozostałe zostały zrobione przeze mnie, głównie w darmowej aplikacji graifcznej Blender, muzyka w grze, efekty dźwiękowe oraz wszystkie skrypty zostały stworzone przeze mnie. Gra polega na doprowadzeniu piłki, sterowanej za pomocą joysticka, do kubka, będącego końcem poziomu. Otoczeniem gry, tak jak nazwa sugeruje, są meble oraz obiekty znajdujące się na nich. Oprócz joysticka, sterowanie odbywało się za pomocą przycisku funkcyjnego, który, w zależności od obecnego typu piłki, posiadał różne interackję - piłka tenisowa miała możliwość skoku, dzięki temu, że była lekka, skakała wyżej, lecz nie mogła przewracać niektórych obiektów, kula bilardowa natomiast, była cięższa, przez co skakała niżej, lecz można było przewracać obiekty takie jak notes - taka czynność była konieczna do rozwiązania niektórych poziomów (Ekran 'Example puzzle (knocking over notebook with heavy ball)'). Trzecim rodzajem piłki była piłka plażowa, która na przycisku funkcyjnym kurczyła bądź rozkurczała się, przez co mogła dostać się w miejsca niedostępne dla pozostałych dwóch typów piłek. Dodatkową cechą gry było zdobywanie porozrzucanych po danym poziomie gwiazdek (maks. 3), co wpływało na finalny wynik poziomu. Gra posiadała parę mechanik urozmaicających rozgrywkę - lód, blokujący sterowanie piłki, wentylatory odpychające piłkę w kierunku podmuchu wiatru, bądź gumki do ścierania odbijające piłkę.",
          "images" : [ 
              {
                  "original": "https://i.imgur.com/euh4Cbx.png",
                  "thumbnail": "https://i.imgur.com/euh4Cbx.png",
                  "description": "Main Menu"
              },
              {
                  "original" : "https://i.imgur.com/N8icGnW.png",
                  "thumbnail" : "https://i.imgur.com/N8icGnW.png",
                  "description": "Options Menu"
              },
              {
                  "original": "https://i.imgur.com/DI6sOMP.png",
                  "thumbnail": "https://i.imgur.com/DI6sOMP.png",
                  "description": "Level Selection"
              },
              {
                  "original": "https://i.imgur.com/DrQ73EH.png",
                  "thumbnail": "https://i.imgur.com/DrQ73EH.png",
                  "description": "Starting Level"
              },
              {
                  "original": "https://i.imgur.com/YW7mqtu.png",
                  "thumbnail": "https://i.imgur.com/YW7mqtu.png",
                  "description": "Sliding mechanics"
              },
              {
                  "original": "https://i.imgur.com/715gneP.png",
                  "thumbnail": "https://i.imgur.com/715gneP.png",
                  "description": "Level Completed Screen"
              },
              {
                  "original": "https://i.imgur.com/lm8YBco.png",
                  "thumbnail": "https://i.imgur.com/lm8YBco.png",
                  "description": "Example puzzle (knocking over notebook with heavy ball)"
              },
              {
                  "original": "https://i.imgur.com/HbhCF6i.png",
                  "thumbnail": "https://i.imgur.com/HbhCF6i.png",
                  "description": "Diffrent ball types"
              },
              {
                  "original": "https://i.imgur.com/KJGae8b.png",
                  "thumbnail": "https://i.imgur.com/KJGae8b.png",
                  "description": "Pause Screen"
              },
              {
                  "original": "https://i.imgur.com/cWqHN0T.png",
                  "thumbnail": "https://i.imgur.com/cWqHN0T.png",
                  "description": "Air conditioner mechanics (pushing ball in the direction of the wind)"
              }
            ]
          },
          {
            "title": "BillGuide",
            "shortDesc": "Praca w firmie Billennium",
            "url": "",
            "description" : "Projekt 'BillGuide' był projektem rozwijanym w firmie Billennium, mającym na celu wdrożenie grywalizacji oraz sprawdzeniu możliwości technologi AR. Na wstępie zaznacze, że projekt nie został ukończony, więc screenshoty pokazują jedynie koncept, oraz stan aplikacji w momencie mojej pracy nad nią. Składał się on z trzech aplikacji - jednej mobilnej na Androida/iOS oraz dwóch przeglądarkowych - jedna, bazująca na WebGL oraz druga, będąca endopointem. Aplikacja mobilna, po wcześniejszym zalogowaniu się do aplikacji, miała za zadanie wyświetlania dwóch widoków, w zależności od przeskanowanych danych JSON (umieszczonych w kodzie QR, kartkę z odpowiednim formatem dla danego użytkownika można było wygenerować na endpoint-cie). Jednym z widoków był panel informacji o danym użytkowniku (Ekran 'Workers Group info view') - pokazywał stanowisko w grupie, ludzi podporządkowanych pod daną osobę, z tym widokiem można było przeprowadzać interakcję za pomocą dotyku - sweep góra/dół pozwalał na scrollowanie viewboxa, za pomocą sygnatur pinchu oraz expandu można było powiększać bądź zmiejszać widok, sweep na lewo bądź prawo zmieniał widok informacji między widokiem grupy przynależności, a informacji szczegółowych o pracowniku (niestety nie posiadam screena z tego widoku). Drugim zastosowaniem aplikacji mobilnej było wyświetlanie awatara będącego elementem grywalizacji - poszczególne elementy ubioru/wyglądu można było edytować w aplikacji webowej (Ekran 'Avatar editor view (WebGL)'). Kolejne elementy wyglądu można było odblokować za pomocą wirtualnej waluty, docelowo zdobywanej poprzez zasługi w firmie. Dodatkowymi elemenetami awatara były animacje oraz efekty specjalne takie jak efekt fajerwerek (Ekran 'Old avatar + unlockable fireworks effect (inside editor)'). Aplikacja miała w planach integrację z systemem szkoleniowym pracowników - po każdym kursie użytkownik miał dostawać daną ilość wirtualnej waluty, a awatar, w zależności od rezultatu kursu, powinien odgrywać animację cieszynki bądź porażki. Moimi osobistymi pomysłami na rozbudowę aplikacji było dodanie dodatkowej logiki podczas skanowania kodu QR z innym use-caseam tj. integrację aplikacji mobilnej z systemem rezerwacji sal, dzięki czemu użytkownik mógł zeskanować kod na drzwiach, wyświetlić panel sterujący, po czym sprawidzić informację o rezerwacjach sali, bądź daną salę zarezerwować na spotkanie. Innym pomysłem było dodanie funkcji przewodnika - wybieramy punkt do którego chcemy się udać, a aplikacja pokazuje nam trasę do punktu docelowego w przestrzeni 3D nałożonego na widok z przedniej kamery telefonu.",
            "images" : [ 
                {
                    "original": "https://i.imgur.com/ioZoUq3.png",
                    "thumbnail": "https://i.imgur.com/ioZoUq3.png",
                    "description": "Smartphone app login screen"
                },
                {
                    "original" : "https://i.imgur.com/Q8znKXP.jpg",
                    "thumbnail" : "https://i.imgur.com/Q8znKXP.jpg",
                    "description": "Image Target + QR Code Card"
                },
                {
                    "original": "https://i.imgur.com/OSI45MI.jpg",
                    "thumbnail": "https://i.imgur.com/OSI45MI.jpg",
                    "description": "Workers Group info view"
                },
                {
                    "original": "https://i.imgur.com/jZJNgEG.jpg",
                    "thumbnail": "https://i.imgur.com/jZJNgEG.jpg",
                    "description": "Workers Group info view"
                },
                {
                    "original": "https://i.imgur.com/5uTXapi.jpg",
                    "thumbnail": "https://i.imgur.com/5uTXapi.jpg",
                    "description": "Old avatar + unlockable fireworks effect (inside editor)"
                },
                {
                    "original": "https://i.imgur.com/qlsxBIY.jpg",
                    "thumbnail": "https://i.imgur.com/qlsxBIY.jpg",
                    "description": "Avatar editor view (WebGL)"
                },
                {
                    "original": "https://i.imgur.com/KZoDXiV.jpg",
                    "thumbnail": "https://i.imgur.com/KZoDXiV.jpg",
                    "description": "Avatar editor view - unlocking new clothing (WebGL)"
                },
                {
                    "original": "https://i.imgur.com/yjMbQly.jpg",
                    "thumbnail": "https://i.imgur.com/yjMbQly.jpg",
                    "description": "Avatar editor view (WebGL)"
                },
                {
                    "original": "https://i.imgur.com/IwrAcDj.jpg",
                    "thumbnail": "https://i.imgur.com/IwrAcDj.jpg",
                    "description": "Avatar editor view (WebGL)"
                }
              ]
            }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
